
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Менеджер = РегистрыСведений.СтатусыСертификатов.СоздатьМенеджерЗаписи();
	Менеджер.Период = ЭтотОбъект.Дата;
	Менеджер.Сертификат = ЭтотОбъект.Сертификат;
	Менеджер.Статус = Перечисления.СтатусыСертификатов.Погашен;
	Менеджер.Записать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Менеджер = РегистрыСведений.СтатусыСертификатов.СоздатьМенеджерЗаписи();
	Менеджер.Период = ЭтотОбъект.Дата;
	Менеджер.Сертификат = ЭтотОбъект.Сертификат;
	Менеджер.Статус = Перечисления.СтатусыСертификатов.Погашен;
	Менеджер.Удалить();
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
