#Область Взаимодействия

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
//	Настройки = RebbitMQСервер.ПолучитьНастройкиПодключенияИзРегистра();
	Настройки = Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ТочкаОбмена,ИмяОчереди,Таймаут,КлючМаршрута");
	ЗаполнитьЗначенияСвойств(Настройки, Запись);
	
	Компонента = RebbitMQСервер.ПолучитьКомпоненту();  
	
	RebbitMQКлиентСервер.ПроверитьПодключение(Компонента, Настройки);
КонецПроцедуры
#КонецОбласти
