
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Статус") Тогда
		ОбщегоНазначенияСлужебныйКлиентСервер.УстановитьПараметрДинамическогоСписка(
			ЭтотОбъект["Список"],
			"Статус",
			Параметры.Статус,
			Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ОповеститьОВыборе(ТекДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти