
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Менеджер = РегистрыСведений.СтатусыСертификатов.СоздатьМенеджерЗаписи();
	Менеджер.Период = ЭтотОбъект.Дата;
	Менеджер.Сертификат = ЭтотОбъект.Сертификат;
	Менеджер.Статус = Перечисления.СтатусыСертификатов.Выдан;
	Менеджер.Записать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Менеджер = РегистрыСведений.СтатусыСертификатов.СоздатьМенеджерЗаписи();
	Менеджер.Период = ЭтотОбъект.Дата;
	Менеджер.Сертификат = ЭтотОбъект.Сертификат;
	Менеджер.Статус = Перечисления.СтатусыСертификатов.Выдан;
	Менеджер.Удалить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
