#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("РегистрСведений.КАБНастройкиПодключенияКRebbitMQ.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	Настройки = RebbitMQСервер.ПолучитьНастройкиПодключенияИзРегистра();
	
	Компонента = RebbitMQСервер.ПолучитьКомпоненту();
	
	ТекстJSON = RebbitMQКлиентСервер.СериализоватьВJSON(СообщениеДляОтправки);	
	
	RebbitMQКлиентСервер.ОтправитьСообщение(Компонента, Настройки, ТекстJSON);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщение(Команда)
	ПолучитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщениеНаСервере()
	
	Настройки = RebbitMQСервер.ПолучитьНастройкиПодключенияИзРегистра();
	
	Компонента = RebbitMQСервер.ПолучитьКомпоненту();
	
	Ответ = RebbitMQКлиентСервер.ПрочитатьСообщение(Компонента, Настройки);
	
КонецПроцедуры

#КонецОбласти